{
  "subjects": [
    {
      "id": "1000003-B",
      "name": "Algebra Lineal",
      "credits": 4,
      "type": "FUND. OPTATIVA (O)",
      "Description": "OBJETIVOS: Asimilar los fundamentos del Algebra Lineal, a nivel elemental, pero con la profundidad necesaria para adquirir los conocimientos y habilidades básicas (capacidad de análisis y de razonamiento lógico - deductivo) para la solución de problemas en las cuales estén involucrados los elementos matemáticos de sistemas de ecuaciones lineales, espacios vectoriales, valores y vectores propios de una matriz y diagonalización de matrices. METODOLOGÍA: La modalidad de cursos magistrales consiste de un sistema integrado de conferencias teóricas, talleres y asesorías. Cada curso magistral tiene dos conferencias teóricas a la semana, de dos horas cada una, y son atendidas por profesores de planta, por monitores académicos de posgrado y en casos excepcionales por docentes ocasionales. El estudiante de un curso magistral tiene la opción de asistir a un taller semanal de dos horas, que sirve de refuerzo a la clase teórica y que está a cargo de un monitor académico de posgrado o de pregrado. Así mismo el estudiante puede ser atendido de manera individual en las asesorías. Las asesorías son brinadadas, tanto por los profesores de planta como por los monitores académicos de posgardo y pregrado. En las asesorías el estudiante consulta las dudas teóricas y recibe orientación acerca de los ejercicios que no pudo resolver en su trabajo personal. La asistencia de los estudiantes a las asesorías es opcional."
    },
    {
      "id": 2015555,
      "name": "Algebra lineal basica",
      "credits": 4,
      "type": "FUND. OPTATIVA (O)",
      "Description": "El curso básico de álgebra lineal consta de dos partes. En una de ellas se estudian los espacios vectoriales, las transformaciones lineales, el álgebra de las matrices, la teoría de determinantes y la solución de sistemas de ecuaciones lineales. La otra parte del curso tiene que ver con aspectos geométricos elementales del álgebra lineal y se estudian conceptos y técnicas básicas de álgebra vectorial en R2, R3 y Rn. Se destacan la existencia de las bases, el teorema del rango para transformaciones lineales, el teorema de representación de transformaciones lineales por medio de matrices, el algoritmo de Gauss-Jordan para calcular rangos, nulidades, determinantes, inversas de matrices y resolver sistemas de ecuaciones lineales. En la parte geométrica se destacan el producto interno, la noción de distancia, la desigualdad triangular, la desigualdad de Cauchy-Schwartz y método de ortogonalización de Gram-Schmidt."
    },
    {
      "id": 2016696,
      "name": "Algoritmos",
      "credits": 3,
      "type": "FUND. OBLIGATORIA (B)",
      "Description": "Asignatura del componente fundamental del Programa de Ingeniería de Sistemas y Computación, que contiene los temas pertinentes para el análisis y diseño de algoritmos de manera eficiente para resolver problemas. El objetivo del curso es estudiar los principios fundamentales de la resolución de problemas a través de algortimos informáticos OBJETIVO GENERAL Estudiar los principios fundamentales de la resolución de problemas a través de algortimos informáticos. El curso aborda dos aspectos principales: el análsis de algoritmos y el diseño de algoritmos eficientes. El análisis de algoritmos estudia las herramientas matemáticas que permiten caracterizar la eficacia y eficiencia, en términos de tiempo y memoria, de un algoritmo. El diseño del algoritmo estudia varios tipos de problemas y técnicas para resolverlos de manera eficiente. OBJETIVOS ESPECÍFICOS  Evaluar matemáticamente el desempeño de un algoritmo desde el punto de vista de la eficacia y eficiencia.  Aplicar las principales estrategias de solución de problemas algorítmicos.  Conocer y entender la importancia de problemas \"Fundamentales\" en algoritmia.  Diseñar, desarrollar e implementar soluciones algorítmicas con base en criterios de calidad tales como corrección, eficiencia (temporal y espacial) y simplicidad. METODOLOGÍA El contenido es impartido por el profesor en clase, y los estudiantes desarrollon talleres apoyados por herramientas tecnológicas y aplican los conocimientos adquiridos en un proyecto."
    },
    {
      "id": 2016697,
      "name": "Arquitectura de computadores",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": "OBJETIVO GENERAL Hacer que el alumno adquiera los conocimientos básicos que le permitan entender cuales son los componentes hardware necesario y su respectivo procesamiento de instrucciones para la interconexión en la arquitectura de los computadores de propósito general. OBJETIVOS ESPECÍFICOS: - Conocer los sistemas numéricos más utilizados para el trabajo con maquinas electrónicas digitales. - Conocer la estructura interna de los microprocesadores en especial los suministrados por INTEL y MOTOROLA. - Entender los diagramas de tiempo, relacionados con el acceso a memoria principal. - Analizar el comportamiento de las operaciones realizadas por la ALU. - Diferenciar las funciones de los tres buses externos del procesador. - Analizar y utilizar correctamente las instrucciones más empleadas en el diseño de software. - Escribir cortos programas en lenguaje ensamblador y entender la decodificación de las instrucciones. - Conocer la estructura de comunicación con las diferentes interfaces de E/S. - Conocer los mecanismos de comunicación de un procesador con los diferentes tipos de memorias."
    },
    {
      "id": 2025983,
      "name": "Arquitectura de infraestructura y gobierno de tics",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": "Dentro de los objetivos específicos de la carrera de Ingeniería de Sistemas y Computación, se establece el proporcionar la formación para que el profesional pueda desempeñarse en actividades de asesoría, interventoría, consultoría y auditoría, relacionadas con sistemas informáticos. También se define en el perfil profesional la capacidad de ejercer su profesión en el diseño, implantación, gestión, evaluación y desarrollo de diferentes clases de sistemas o servicios que estén relacionados con el manejo de la información o conocimiento. En consonancia, el programa tiene en cuenta procesos de formación a través del componente profesional en la línea de software y manejo de información. Este es un programa acorde con ese lineamiento curricular. OBJETIVOS 1. Proveer los elementos conceptuales que debe manejar un Director de Sistemas, con las prácticas actuales y pertinentes del estado del arte. 2. Contribuir al desarrollo de las competencias funcionales necesarias para el desempeño de los futuros Ingenieros de Sistemas en los roles de Dirección. 3. Proporcionar al futuro Ingeniero de Sistemas los elementos para planificar, analizar, diseñar, implementar, administrar y evaluar sistemas computacionales, de servicios basados en éstos, sistemas complejos de información y de conocimiento. - METODOLOGÍA En este curso se asume la educación como un proceso de interacción dinámica centrada en los participantes, donde el rol del profesor, además de proveer su experiencia profesional y los elementos conceptuales, se concentra en ser un dinamizador. Desde esta perspectiva, la metodología debe refleja el enfoque propiciando el desarrollo de las competencias propuestas. Se pretende entonces una participación activa y productiva en el desarrollo del curso, a través de: a) exposición magistral, b) talleres para temas seleccionados, c) sustentación y argumentación de los trabajos de proyectos."
    },
    {
      "id": 2016716,
      "name": "Arquitectura de Software",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": "At the end of the course the students will be able to:  Develop professional skills.  Understand the software architecture concepts.  Practice of architecting through a case study.  Model software architecture through architectural views.  Documenting software architecture using Architecture Description Document.  Take architectural decisions through the conception and use of software architecture styles and software architecture patterns.  Understand main topics of software architecture with respect to quality attributes: interoperability, usability, security, performance, scalability, resilience and availability."
    },
    {
      "id": 2016353,
      "name": "Bases de datos",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": "Este curso es una introducción a los sistemas de bases de datos relacionales, que pretende ilustrar conceptos y técnicas asociados con el diseño, implementación y uso de dichos sistemas. OBJETIVO GENERAL Este curso pretende capacitar al estudiante en principios y técnicas que permitan diseñar, implementar y usar un sistema de bases de datos relacional. OBJETIVOS ESPECÍFICOS &#61623; Capacitar al estudiante en la metodología formal del diseño de bases de datos. &#61623; Capacitar al estudiante en las operaciones de algebra relacional implicadas en la manejo de los datos. &#61623; Capacitar al estudiante en instrucciones SQL para el manejo de datos. METODOLOGÍA El contenido es impartido por el profesor en clase, y los estudiantes desarrollan talleres y aplican los conocimientos adquiridos en un proyecto desarrollado durante el semestre."
    },
    {
      "id": "1000004-B",
      "name": "Calculo diferencial",
      "credits": 4,
      "type": "FUND. OPTATIVA (O)",
      "Description": "OBJETIVOS Estudiar los conceptos de límite y derivada para funciones de una variable real y utilizar estas ideas en la solución de problemas de optimización, trazado de curvas y razones de cambio. METODOLOGÍA: La modalidad de cursos magistrales consiste de un sistema integrado de conferencias teóricas, talleres y asesorías. Cada curso magistral tiene dos conferencias teóricas a la semana, de dos horas cada una, y son atendidas por profesores de planta, por monitores académicos de posgrado y en casos excepcionales por docentes ocasionales. El estudiante de un curso magistral tiene la opción de asistir a un taller semanal de dos horas, que sirve de refuerzo a la clase teórica y que está a cargo de un monitor académico de posgrado o de pregrado. Así mismo el estudiante puede ser atendido de manera individual en las asesorías. Las asesorías son brinadadas, tanto por los profesores de planta como por los monitores académicos de posgardo y pregrado. En las asesorías el estudiante consulta las dudas teóricas y recibe orientación acerca de los ejercicios que no pudo resolver en su trabajo personal. La asistencia de los estudiantes a las asesorías es opcional."
    },
    {
      "id": "1000006-B",
      "name": "Calculo en varias variables",
      "credits": 4,
      "type": "FUND. OPTATIVA (O)",
      "Description": "OBJETIVOS: ¿ Estudiar los conceptos fundamentales del cálculo de funciones de varias variables (límites, continuidad, diferenciación e integración) y los teoremas centrales del Cálculo vectorial (Teoremas de Green, Gauss y Stokes). ¿ Estimular y desarrollar la capacidad de análisis y de razonamiento lógico-deductivo del estudiante. ¿ Capacitar al estudiante para la interpretación, formulación y solución de problemas en las áreas relacionadas con su especialidad en las cuales se haga necesario la aplicación del cálculo de funciones de varias variables y del cálculo vectorial."
    },
    {
      "id": "1000005-B",
      "name": "Calculo Integral",
      "credits": 4,
      "type": "FUND. OPTATIVA (O)",
      "Description": "OBJETIVOS General ¿ Lograr la apropiación por parte del. estudiante de los conceptos fundamentales del cálculo integral de funciones de una variable real y crear habilidades que le permitan aplicar estos conocimientos en problemas propios de su disciplina y abordar de manera elemental los conceptos de sucesiones y series. Específicos ¿ Conocer y manejar con propiedad el concepto de integral definida de una función real de una variable real y su relación con el concepto de primitiva o antiderivada, para facilitar los cálculos. ¿ Estudiar algunas de las diferentes aplicaciones del concepto de integral. ¿ Adquirir destrezas en el estudio de la convergencia de sucesiones y series"
    },
    {
      "id": 2015556,
      "name": "Calculo integral en una variable",
      "credits": 4,
      "type": "FUND. OPTATIVA (O)",
      "Description": "Objetivo: Estudiar los conceptos de límite y derivada para funciones de una variable real y utilizar estas ideas en la solución de problemas de optimización, trazado de curvas y razones de cambio. Conceptos Previos: Cálculo diferencial en una variable"
    },
    {
      "id": 2015162,
      "name": "Calculo vectorial",
      "credits": 4,
      "type": "FUND. OPTATIVA (O)",
      "Description": "Objetivos: 1. Entender las nociones de derivación e integración al curso de funciones de varias variables. 2. Estudiar los teoremas clásicos del cálculo vectorial. Conceptos Previos: Cálculo integral en una variable"
    },
    {
      "id": 2025965,
      "name": "Complemento a teoria de la computacion",
      "credits": 1,
      "type": "FUND. OBLIGATORIA (B)",
      "Description": "Complemento a Teoría de la Computación para el proceso de migración a la modificación curricular del plan de estudios de Ingeniería de Sistemas y Computación."
    },
    {
      "id": 2016722,
      "name": "Computacion paralela y distribuida",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": "Objetivo general del curso: El estudiante adquirirá habilidades para diseñar, implementar y desplegar sistemas de software paralelos y distribuidos acordes a las necesidades de procesamiento, memoria y desempeño requeridos para la solución de un problema específico."
    },
    {
      "id": 2025960,
      "name": "Computacion visual",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": "Brindar una introducción a los conceptos básicos de la computación gráfica y el procesamiento de imágenes, tomando como eje central el estudio del pipeline gráfico presente en diferentes plataformas modernas, que tienen en común la existencia de hardware dedicado para el procesamiento gráfico."
    },
    {
      "id": 2016492,
      "name": "Comunicaciones",
      "credits": 3,
      "type": "DISCIPLINAR OPTATIVA (T)",
      "Description": "Estudio y comprensión de los principios y los sistemas de comunicaciones simples y complejos desde el punto de vista de la teoría de señales como de los bloques funcionales. Se desarrollan dos partes distinguibles de las comunicaciones, los sistemas analógicos y los sistemas digitales. Se inicia con una breve introducción a la teoría de señales y a la teoría de la información, fundamentales en comunicaciones. Se estudian los casos convencionales de modulación analógica AM, PM y FM considerando sus espectros, rendimientos y características esenciales; de manera similar, se abordan los sistemas de comunicación digital con señalización en banda base y posteriormente los diferentes tipos de modulación incluyendo los sistemas de comunicaciones actuales de espectro ensanchado. Finalmente se estudia el ruido y su influencia en los sistemas de comunicaciones."
    },
    {
      "id": 2016028,
      "name": "Diseno, gestion y evaluacion de proyectos",
      "credits": 4,
      "type": "FUND. OPTATIVA (O)",
      "Description": "Los proyectos permiten la creación de productos y servicios para la sociedad. Un proyecto aprovecha oportunidades y resuelve problemas, sus productos generan desarrollo y por ende es de vital importancia para el país preparar a sus profesionales en la gerencia de proyectos de tal manera que puedan aportar en el desarrollo de estrategias en entornos de competencia. La adecuada definición, gestión y evaluación de proyectos permite implementar exitosamente ideas, estrategias y/o emprendimientos en cualquier industria o sector de la sociedad. Esto obliga a que los profesionales cuenten con herramientas para formular, desarrollar y gestionar un proyecto. El objetivo principal del curso es enseñar al estudiante cómo gerenciar adecuadamente los proyectos en cualquier campo de la economía. Con este curso la Escuela de Administración de Empresas y Contaduría Pública busca afianzar conocimientos en los participantes para que en su ejercicio profesional contribuyan al desarrollo económico y social a través de proyectos que generen valor al entorno socioeconómico colombiano. Para lograr lo anterior, además de bibliografía especializada, se hará uso de metodologías estándares globales tipo PMI."
    },
    {
      "id": "1000007-B",
      "name": "Ecuaciones Diferenciales",
      "credits": 4,
      "type": "FUND. OPTATIVA (O)",
      "Description": "OBJETIVOS: Modelar por medio de ecuaciones diferenciales algunos sistemas simples y predecir su comportamiento. Comprender y utilizar las diferentes técnicas analíticas y cualitativas para resolver ecuaciones diferenciales. METODOLOGÍA: La modalidad de cursos magistrales consiste de un sistema integrado de conferencias teóricas, talleres y asesorías. Cada curso magistral tiene dos conferencias teóricas a la semana, de dos horas cada una, y son atendidas por profesores de planta, por monitores académicos de posgrado y en casos excepcionales por docentes ocasionales. El estudiante de un curso magistral tiene la opción de asistir a un taller semanal de dos horas, que sirve de refuerzo a la clase teórica y que está a cargo de un monitor académico de posgrado o de pregrado. Así mismo el estudiante puede ser atendido de manera individual en las asesorías. Las asesorías son brinadadas, tanto por los profesores de planta como por los monitores académicos de posgardo y pregrado. En las asesorías el estudiante consulta las dudas teóricas y recibe orientación acerca de los ejercicios que no pudo resolver en su trabajo personal. La asistencia de los estudiantes a las asesorías es opcional."
    },
    {
      "id": 2016698,
      "name": "Elementos de computadores",
      "credits": 3,
      "type": "DISCIPLINAR OPTATIVA (T)",
      "Description": "Asignatura disciplinar del programa de Ingeniería de Sistemas y Computación. Se abarcan técnicas de análsisis y diseño de sistemas digitales, y se estudian circuitos usados habitualmente en el ámbito de la computación electrónica. La asignatura consta de dos grandes bloques en el que se estudian los distintos sistemas digitales en orden creciente de complejidad, partiendo de diseños sencillos hasta llegar a estructuras de relativa complejidad. OBJETIVOS  El objetivo general de las asignaturas es mostrar a los alumnos las principales técnicas de análsis y diseño de sistemas digitales, así como los circuitos usados habitualmente en el ámbito de la computación electrónica.  Conocer las bases de la teoría aritmética digital, las técnicas de codificación digital, los fundamentos teóricos del álgebra de conmutación, dominio de las técnicas de diseño combinacional de circuitos lógicos, los conceptos de memoria y máquinas de estado.  Analizar y diseñar circuitos secuenciales.  Conocer y usar algunos paquetes de software de ayuda al diseño de sistemas digitales. METODOLOGÍA El curso se desarrolla mediante clases magistrales por parte del profesor. Se realizan talleres, ejercicios y presentaciones por parte de los estudiantes. Se realizan evaluaciones y se fomenta el uso de software para el diseño de sistemas digitales."
    },
    {
      "id": 2016699,
      "name": "Estructuras de datos",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": "Objetivo del curso: Adquirir conceptos, técnicas y métodos básicos sobre las estructuras de datos fundamentales, que permitan al estudiante la implementación y aplicación eficiente de dichas estructuras en la solución de problemas."
    },
    {
      "id": "1000017-B",
      "name": "Fundamentos de electricidad y magnetismo",
      "credits": 4,
      "type": "FUND. OBLIGATORIA (B)",
      "Description": ""
    },
    {
      "id": "1000019-B",
      "name": "Fundamentos de mecanica",
      "credits": 4,
      "type": "FUND. OBLIGATORIA (B)",
      "Description": ""
    },
    {
      "id": 2015702,
      "name": "Gerencia y gestion de proyectos",
      "credits": 3,
      "type": "FUND. OPTATIVA (O)",
      "Description": "Objetivos: El curso busca preparar al futuro ingeniero en las metodologías de formulación, evaluación y gestión de proyectos, como una de las actividades habituales que desempeñan los ingenieros en entidades públicas o privadas."
    },
    {
      "id": 2016701,
      "name": "Ingenieria de software I",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": "Asignatura práctica en la cual el estudiante aprenderá a formular, diseñar, desarrollar y evaluar sistemas de software. OBJETIVOS Al finalizar este curso el estudiante estará en capacidad de:  Formular, desarrollar y evaluar sistemas de software con herramientas estandarizadas.  Estudiar un dominio de problema para recolectar y validar requerimientos para sistemas de software.  Diseñar software utilizando diagramas y escogiendo la arquitectura apropiada.  Comenzar a trabajar en equipos de proyectos de software.  Formular métricas de software para evaluar y probar su software. METODOLOGÍA Asignatura con alto contenido práctico. Los temas se impartirán en clase y se aplocarán en el desarrollo de proyectos a lo largo del semestre. Los proyectos se desarrollan en grupo, y de ser posible se participará en hackatones. Se realizan talleres específicos y parciales."
    },
    {
      "id": 2016702,
      "name": "Ingenieria de software II",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": "OBJETIVOS ESPECÍFICOS Al final del curso, los estudiantes podrán:  Distinguir claramente entre los procesos de software basados en modelos clásicos y métodos ágiles.  Identificar los conceptos básicos relacionados con el desarrollo web y la forma en que las aplicaciones Web 2.0 funcionan en un entorno real incluyendo soluciones en la nube.  Recordar y reforzar habilidades básicas de trabajo en equipo y valores centrales necesarios para trabajar en el desarrollo de Software en un ambiente real.  Aplicar los conceptos principales de la ingenieróa de software moderna en la práctica desarrollando una aplicación web real con las tecnologías de la industria de hoy, utilizando herramientas de soporte profesional y siguiendo un modelo ágil de proceso definido. METODOLOGÍA En este curso, los estudiantes se organizan en grupos para ejecutar un pequeño proyecto de desarrollo web, siguiendo un proceso ágil basado en la metodología SCRUM, y usando herramientas profesionales para apoyar tanto las actividades técnicas como administrativas. la mayoría de los temas tratados en las sesiones de clase están diseñados para respaldar el desarrollo adecuado del proyecto y proporcionar conocimientos importatnes relacionados con la ingeniería de software que se aplicarán y experimentarán durante el desarrollo de proyecto. Sin embargo, dependiendo del tipo de proyecto, algunas de las necesidades de aprendizaje y capacitación deben ser cubiertas por los integrantes del equipo de manera autónoma."
    },
    {
      "id": 2015703,
      "name": "Ingenieria economica",
      "credits": 3,
      "type": "FUND. OPTATIVA (O)",
      "Description": "Suministrar al estudiante de ingeniería en la Universidad Nacional de Colombia los conceptos básicos de la teoría económica que le permitan desarrollar su capacidad de análisis y comprensión de las áreas propias de sus actividades profesionales y en parti"
    },
    {
      "id": 2025986,
      "name": "Ingenieria economica y analisis de riesgo",
      "credits": 3,
      "type": "FUND. OPTATIVA (O)",
      "Description": "OBJETIVO Presentar los conceptos fundamentales de la Ingeniería Económica y su importancia en la evaluación de proyectos de ingeniería para la toma de decisiones. METODOLOGIA Exposiciones del profesor.- Ejercicios y aplicaciones de los conceptos a través de talleres en clase y fuera de clase.- Exposiciones de los estudiantes sobre temas específicos.- Uso intensivo de herramientas informáticas de Excel financiero)"
    },
    {
      "id": "1000044-B",
      "name": "Ingles I- Semestral",
      "credits": 3,
      "type": "NIVELACIÓN (E)",
      "Description": "Se espera que los estudiantes al término de este primer nivel de inglés, puedan comprender textos expositivos cortos relacionados con temáticas de tipo académico y que además, puedan expresar de manera oral y escrita información de tipo personal. Con base en un listado de descriptores predeterminados, el profesor selecciona el material que puede utilizar y ayuda al estudiante a partir del uso de estrategias de aprendizaje, para que poco a poco sea él o ella quien tenga el criterio para saber qué información le sirve, por qué y cómo usarla."
    },
    {
      "id": "1000048-B",
      "name": "Ingles I- Virtual",
      "credits": 3,
      "type": "NIVELACIÓN (E)",
      "Description": "Se espera que los estudiantes al término de este primer nivel de inglés, puedan comprender textos expositivos cortos relacionados con temáticas de tipo académico y que además, puedan expresar de manera oral y escrita información de tipo personal. Con base en un listado de descriptores predeterminados, el profesor selecciona el material que puede utilizar y ayuda al estudiante a partir del uso de estrategias de aprendizaje, para que poco a poco sea él o ella quien tenga el criterio para saber qué información le sirve, por qué y cómo usarla.Este curso está dirigido a estudiantes de la Sede Bogotá, interesados en aprender o en avanzar en el aprendizaje del inglés, apoyándose en medios virtuales. El entorno virtual lo conforman los espacios proporcionados por la plataforma Blackboard ( a través de la página web de la Universidad) y las herramientas que ésta brinda (curso, foros, chats, etc.). En el entorno virtual se presentan explicaciones y contextos para comprender aspectos de la lengua y practicar conocimientos adquiridos. El entorno virtual es el eje del programa y requiere del estudiante disciplina para concentrarse en el aprendizaje y práctica del idioma."
    },
    {
      "id": "1000045-B",
      "name": "Ingles II - Semestral",
      "credits": 3,
      "type": "NIVELACIÓN (E)",
      "Description": "Se espera que los estudiantes, al término del segundo nivel, puedan comprender textos expositivos y narrativos relacionados con temáticas de tipo académico y de cultura general. Se espera que en términos de comprensión escrita, el estudiante pueda identificar relaciones de temporalidad y secuencia, de contraste y de causa y efecto. Además se espera que puedan expresar de manera oral y escrita información relacionada con la descripción detallada de lugares, de estados de salud, eventos del pasado y planes. A partir de un listado de descriptores predeterminados, el profesor selecciona el material que puede utilizar y ayuda al estudiante, a través del uso de estrategias de aprendizaje, para que poco a poco sea él o ella quien tenga el criterio para saber qué le sirve, por qué y cómo usarlo. Se cuenta con un Centro de Recursos que le brinda tanto a profesores como estudiantes un buen número de recursos para la enseñanza y aprendizaje de la lengua."
    },
    {
      "id": "1000049-B",
      "name": "Ingles II - Virtual",
      "credits": 3,
      "type": "NIVELACIÓN (E)",
      "Description": "Se espera que los estudiantes, al término del segundo nivel, puedan comprender textos expositivos y narrativos relacionados con temáticas de tipo académico y de cultura general.Se esperaque en términos de comprensión escrita, el estudiante pueda identificar relaciones de temporalidad ysecuencia, de contraste y de causa y efecto. Además se espera que puedan expresar de manera oral y escrita información relacionada con la descripción detallada de lugares, de estados de salud, eventos del pasado y planes. A partir de un listado de descriptores predeterminados, el profesor selecciona el material que puede utilizar y ayuda al estudiante, a través del uso de estrategias de aprendizaje, para que poco a poco sea él o ella quien tenga el criterio para saber qué le sirve, por qué y cómo usarlo. Se cuenta con un Centro de Recursos que le brinda tanto a profesores como estudiantes un buen número de recursos para la enseñana y aprendizaje de la lengua. Este curso está dirigido a estudiantes de la Sede Bogotá, interesados en aprender o en avanzar en el aprendizaje del inglés, apoyándose en medios virtuales. El entorno virtual lo conforman los espacios proporcionados por la plataforma Blackboard ( a través de la página web de la Universidad) y las herramientas que ésta brind (curso, foros, chats, etc.). En el entorno virtual se presentan explicaciones y contextos para comprender aspectos de la lengua y practicar conocimientos adquiridos. El entorno virtual es el eje del programa y requiere del estudiante disciplina para concentrarse en el aprendizaje y práctica del idioma."
    },
    {
      "id": 2023925,
      "name": "Ingles II- Intensivo",
      "credits": 3,
      "type": "NIVELACIÓN (E)",
      "Description": "Se espera que los estudiantes, al término del segundo nivel, puedan comprender textos expositivos y narrativos relacionados con temáticas de tipo académico y de cultura general.Se espera que en términos de comprensión escrita, el estudiante pueda identifi"
    },
    {
      "id": "1000046-B",
      "name": "Ingles III - Semestral",
      "credits": 3,
      "type": "NIVELACIÓN (E)",
      "Description": "Se espera que los estudiantes, al término del tercer nivel, puedan leer y comprender textos auténticos de tipo académico y cultural, en los que, por ejemplo, se narren eventos o se describa un concepto a través del tiempo, se presente información de tipo periodístico, se explique el desarrollo de un fenómeno a través de una línea de realaciones de causa y efecto o se presente de manera sustentada un determinado punto de vista. Además se espera que puedan expresar de manera oral y escrita información relacionada con los conceptos trabajados a partir de la comprensión de lectura, que puedan sustentar su punto de vista y hacer reporte de la información queotraspersonaslestransmitan. Se cuenta con un Centro de Recursos que le brinda tanto a profesores como estudiantes un buen número de recursos para la enseñana y aprendizaje de la lengua."
    },
    {
      "id": "1000050-B",
      "name": "Ingles III- Virtual",
      "credits": 3,
      "type": "NIVELACIÓN (E)",
      "Description": "Se espera que los estudiantes, al término del tercer nivel, puedan leer y comprender textos auténticos de tipo académico y cultural, en los que, por ejemplo, se narren eventos o se describa un concepto a través del tiempo, se presente información de tipo periodístico, se explique el desarrollo de un fenómeno a través de una línea de realaciones de causa y efecto o se presente de manera sustentada un determinado punto de vista. Además se espera que puedan expresar de manera oral y escrita información relacionada con los conceptos trabajados a partir de la comprensión de lectura, que puedan sustentar su punto de vista y hacer reporte de la información queotraspersonaslestransmitan. Se cuenta con un Centro de Recursos que le brinda tanto a profesores como estudiantes un buen número de recursos para la enseñana y aprendizaje de la lengua. Este curso está dirigido a estudiantes de la Sede Bogotá, interesados en aprender o en avanzar en el aprendizaje del inglés, apoyándose en medios virtuales. El entorno virtual lo conforman los espacios proporcionados por la plataforma Blackboard ( a través de la página web de la Universidad) y las herramientas que ésta brind (curso, foros, chats, etc.). En el entorno virtual se presentan explicaciones y contextos para comprender aspectos de la lengua y practicar conocimientos adquiridos. El entorno virtual es el eje del programa y requiere del estudiante disciplina para concentrarse en el aprendizaje y práctica del idioma."
    },
    {
      "id": 2023926,
      "name": "Ingles III-Intensivo",
      "credits": 3,
      "type": "NIVELACIÓN (E)",
      "Description": "Se espera que los estudiantes, al término del tercer nivel, puedan leer y comprender textos auténticos de tipo académico y cultural, en los que, por ejemplo, se narren eventos o se describa un concepto a través del tiempo, se presente información de tipo"
    },
    {
      "id": 2024731,
      "name": "Ingles intensivo I",
      "credits": 3,
      "type": "NIVELACIÓN (E)",
      "Description": "Se espera que los estudiantes al término de este primer nivel de inglés, puedan comprender textos expositivos cortos relacionados con temáticas de tipo académico y que además, puedan expresar de manera oral y escrita información de tipo personal. Los cursos son de carácter presencial y además se espera que el o la estudiante dedique un tiempo al trabajo autónomo en el centro de recursos. Se abordan las cuatro habilidades constitutivas de la competencia comunicativa (comprensión auditiva, expresión oral, expresión escrita y comprensión de lectura) con énfasis en ésta última. Al mismo tiempo se espera que el aprendiente desarrolle su competencia de aprendizaje (aprender a aprender). Metodológicamente, esta asignatura se inscribe en el aprendizaje autónomo de lenguas, en el cual el aprendiente tiene a disposición cuatro modalidades de trabajo: la clase-taller, el trabajo en el Centro de Recursos, el trabajo por proyectos y los encuentros académicos y culturales. Observaciones: Los contenidos de la producción escrita se relacionan con los temas propuestos para gramática y comprensión de lectura y no se explicitan porque se determinan a través de la dinámica del curso. La evaluación de los cursos tiene dos modalidades: Durante el semestre la evaluación es valorativa y evaluativa. Se valora el desempeño de los estudiantes mediante el envío de acticvidades a través de la plataforma virtual, en su presentación de Encuentros Académicos y Culturales y en la realización de los Proyectos. Se hacen por lo tanto reflexiones sobre el proceso de cada estudiante con base en los siguientes criterios"
    },
    {
      "id": "1000052-B",
      "name": "Ingles Intensivo I y II",
      "credits": 6,
      "type": "NIVELACIÓN (E)",
      "Description": "Se espera que los estudiantes al término de los niveles I y II puedan comprender textos expositivos cortos relacionados con temáticas de tipo académico y pueda identificar relaciones de temporalidad ysecuencia, de contraste y de causa y efecto. Los estudiantes pueden expresar de manera oral y escrita información de tipo personal e información relacionada con la descripción detallada de lugares, de estados de salud, eventos del pasado y planes. Con base en un listado de descriptores predeterminados, el profesor selecciona el material que puede utilizar y ayuda al estudiante a partir del uso de estrategias de aprendizaje, para que poco a poco sea él o ella quien tenga el criterio para saber qué información le sirve, por qué y cómo usarla."
    },
    {
      "id": 2022291,
      "name": "Ingles intensivo II",
      "credits": 3,
      "type": "NIVELACIÓN (E)",
      "Description": ""
    },
    {
      "id": 2021183,
      "name": "Ingles Intensivo II y III",
      "credits": 6,
      "type": "NIVELACIÓN (E)",
      "Description": ""
    },
    {
      "id": "1000053-B",
      "name": "Ingles Intensivo III y IV",
      "credits": 6,
      "type": "NIVELACIÓN (E)",
      "Description": "Se espera que los estudiantes, al término de este curso intesivo puedan leer y comprender textos auténticos de tipo académico y cultural, en los que, por ejemplo, se narren eventos o se describa un concepto a través del tiempo, se presente información de tipo periodístico, se explique el desarrollo de un fenómeno a través de una línea de realaciones de causa y efecto o se presente de manera sustentada un determinado punto de vista. Se espera además que los estudiantes puedan leer y comprender textos auténticos de tipo académico con mayor énfasis en reportes de tipo investigativo y argumentativo. Identifican, por lo tanto, los principales aspectos en un reporte de investigación y los argumentos y contra argumentos que aparecen en un ensayo. Además se espera que puedan expresar de manera oral y escrita información relacionada con los conceptos trabajados a partir de la comprensión de lectura, que puedan sustentar su punto de vista y hacer reporte de la información queotraspersonaslestransmitan. Se cuenta con un Centro de Recursos que le brinda tanto a profesores como estudiantes un buen número de recursos para la enseñana y aprendizaje de la lengua. También participan de manera oral en debates en torno a situaciones de tipo académico y cultural y redactan textos con el rigor que se requiere para expresar su punto de vista con respecto a un tema específico y los diferentes argumentos que lo sustentan. Se cuenta con un Centro de Recursos que le brinda tanto a profesores como estudiantes un buen número de recursos para la enseñana y aprendizaje de la lengua y que se relacionan directamente con los contenidos que el curso plantea. Tambien participan de manera oral en debates."
    },
    {
      "id": 2021184,
      "name": "Ingles Intensivo IV",
      "credits": 3,
      "type": "NIVELACIÓN (E)",
      "Description": ""
    },
    {
      "id": 2023927,
      "name": "Ingles IV- intensivo",
      "credits": 3,
      "type": "NIVELACIÓN (E)",
      "Description": "Se espera que los estudiantes, al término del cuarto nivel puedan leer y comprender textos auténticos de tipo académico con mayor énfasis en reportes de tipo investigativo y argumentativo. Identifican, por lo tanto, los principales aspectos en un reporte"
    },
    {
      "id": "1000047-B",
      "name": "Ingles IV- Semestral",
      "credits": 3,
      "type": "NIVELACIÓN (E)",
      "Description": "El objetivo general de los cuatro niveles de lengua en el Programa ALEX es desarrollar la competencia comunicativa en la lengua extranjera elegida por el estudiante (con énfasis en comprensión de lectura) y, paralelamente, su capacidad para tomar decisiones con respecto al proceso de aprendizaje. Se espera que los estudiantes, al término del cuarto nivel puedan leer y comprender textos auténticos de tipo académico con mayor énfasis en reportes de tipo investigativo y argumentativo. Identifican, por lo tanto, los principales aspectos en un reporte de investigación y los argumentos y contra argumentos que aparecen en un ensayo. También participan de manera oral en debates en torno a situaciones de tipo académico y cultural y redactan textos con el rigor que se requiere para expresar su punto de vista con respecto a un tema específico y los diferentes argumentos que lo sustentan. Se cuenta con un Centro de Recursos que le brinda tanto a profesores como estudiantes un buen número de recursos para la enseñana y aprendizaje de la lengua y que se relacionan directamente con los contenidos que el curso plantea."
    },
    {
      "id": "1000051-B",
      "name": "Ingles IV- Virtual",
      "credits": 3,
      "type": "NIVELACIÓN (E)",
      "Description": "El objetivo general de los cuatro niveles de lengua en el Programa ALEX es desarrollar la competencia comunicativa en la lengua extranjera elegida por el estudiante (con énfasis en comprensión de lectura) y, paralelamente, su capacidad para tomar decisiones con respecto al proceso de aprendizaje. Se espera que los estudiantes, al término del cuarto nivel puedan leer y comprender textos auténticos de tipo académico con mayor énfasis en reportes de tipo investigativo y argumentativo. Identifican, por lo tanto, los principales aspectos en un reporte de investigación y los argumentos y contra argumentos que aparecen en un ensayo. También participan de manera oral en debates en torno a situaciones de tipo académico y cultural y redactan textos con el rigor que se requiere para expresar su punto de vista con respecto a un tema específico y los diferentes argumentos que lo sustentan. Se cuenta con un Centro de Recursos que le brinda tanto a profesores como estudiantes un buen número de recursos para la enseñana y aprendizaje de la lengua y que se relacionan directamente con los contenidos que el curso plantea. Este curso está dirigido a estudiantes de la Sede Bogotá, interesados en aprender o en avanzar en el aprendizaje del inglés, apoyándose en medios virtuales. El entorno virtual lo conforman los espacios proporcionados por la plataforma Blackboard ( a través de la página web de la Universidad) y las herramientas que ésta brind (curso, foros, chats, etc.). En el entorno virtual se presentan explicaciones y contextos para comprender aspectos de la lengua y practicar conocimientos adquiridos. El entorno virtual es el eje del programa y requiere del estudiante disciplina para concentrarse en el aprendizaje y práctica del idioma."
    },
    {
      "id": 2016748,
      "name": "Inteligencia artificial",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": ""
    },
    {
      "id": 2025972,
      "name": "Introduccion a la criptografia y a la seguridad de la Informacion",
      "credits": 3,
      "type": "DISCIPLINAR OPTATIVA (T)",
      "Description": "Este curso busca que los asistentes conozcan los conceptos básicos de la criptografía y la seguridad de la información, los cuales le permitirán aplicarlos de manera práctica en diferentes escenarios tales como la construcción de software seguro, protección de redes de comunicaciones, manejo de llaves privada y públicas, manejo de certificados digitales, manejo de firmas digitales, entre otros."
    },
    {
      "id": 2025975,
      "name": "Introduccion a la ingenieria de sistemas y computacion",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": "Asignatura de primer semestre que pretende introducir al estudiante a lo que es la Ingeniería de Sistemas y Computación, ilustrar la evolución histórica de la ingeniería y en específico de la ingeniería de Sistemas y Computación. También se busca fortalecer habilidades blandas en los estudiantes. OBJETIVOS El curso sobre Introducción a la Ingeniería de Sistemas y Computación pretende:  Motivar al estudiante y ubicarlo de la mejor manera en las prácticas sociales de las disciplinas que forman la ingeniería y su especialidad en los sistemas de computación.  Facilitar la comprensión de los conceptos desarrollados y de la evolución histórica de la ingeniería y en específico de la ingeniería de Sistemas y Computación.  Brindar elementos para desarrollar habilidades de comunicación oral y escrita, trabajo en equipo, liderazgo y creatividad. METODOLOGÍA Profesores del departamento e invitados, con base en exposiciones magistrales, presentarán los temas más relevantes del curso. Los estudiantes desarrolláran la parte práctica en forma de talleres libres. Los estudiantes deben presentar reportes de su trabajo Los estudiantes desarrollarán un proyecto de aplicación de los conceptos y métodos de Ingeniería de Sistemas y Computación en la solución de un preblema real. Los estudiantes desarrollarán actividades, a lo largo del curso, para el fortalecimiento de habilidades blandas."
    },
    {
      "id": 2015174,
      "name": "Introduccion a la teoria de la computacion",
      "credits": 4,
      "type": "FUND. OBLIGATORIA (B)",
      "Description": "La Teoría de la Computación estudia modelos abstractos de los dispositivos concretos que conocemos como computadores, y analiza lo que se puede y no se puede hacer con ellos. Se consideran modelos restringidos, llamados autómatas, y se estudia su poder co"
    },
    {
      "id": 2026573,
      "name": "Introduccion a las ciencias de la computacion y a la programacion",
      "credits": 3,
      "type": "DISCIPLINAR OPTATIVA (T)",
      "Description": "Este curso busca presentar las el desarrollo histórico y las ideas fundamentales en computación. OBJETIVOS Conocer la historia de la computación Explorar algunas de las ideas fundamentales en la computación Aprender sobre el proceso de pasar de un planteamiento del problema a una formulación computacional de un método para resolver el problema Aprender un lenguaje de programación para expresar computaciones Aprender sobre el proceso de la escritura y la depuración de un programa Aprender a utilizar simulaciones para arrojar luz sobre los problemas que no sucumben fácilmente a las soluciones de forma cerrada Aprender acerca de cómo utilizar las herramientas computacionales para ayudar a modelar y comprender los datos"
    },
    {
      "id": 2025995,
      "name": "Introduccion a los sistemas inteligentes",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": "Al finalizar el curso se espera que el estudiante conozca y aplique los fundamentos y algunas metodologías que hacen posible la inteligencia artificial, adquiera habilidades para determinar, describir y usar los principios técnicas que permiten el desarrollo de sistemas inteligentes."
    },
    {
      "id": "1000002-B",
      "name": "Lecto-Escritura",
      "credits": 4,
      "type": "NIVELACIÓN (E)",
      "Description": "El objetivo de este curso nivelatorio es cualificar la competencia argumentativa de los estudiantes, en lectura y escritura, por medio de la apropiación de estrategias de comprensión y expresión. Al finalizar el curso los estudiantes estarán en la capacidad de: - Identificar distintos modos discursivos presentes en un texto argumentativo. - Identificar la estructura argumentativa de un texto: Tesis central o hipótesis, premisas, red de relaciones entre la premisas. - Emitir un juicio de valor en la relación con la estructura identificada. - Identificar las distintas posturas que origina la argumentación contenida en el texto. - Construir un texto que tenga una estructura argumentativa."
    },
    {
      "id": 2025966,
      "name": "Lenguajes de programacion",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": "Asignatura del componente disciplinar del Programa de Ingeniería de Sistemas y Computación, pretende forma en el estudiante la capacidad de analizar, diseñar e implementar un lenguaje de programación en el marco de un sistema automático de procesamiento de lenguaje. OBJETIVOS  Formar en el estudiante la capacidad de analizar, diseñar e implementar un lenguaje de programación en el marco de un sistema automático de procesamiento de lenguaje.  Aplicar los conceptos fundamentales de la teoría de la computación en el diseño de lenguajes de programación.  Conocer, desde una perspectiva histórica, el desarrollo de los diferentes lenguajes de programacióm y de los paradigmas de programación.  Determinar la estructura y el funcionamiento de un analizador léxico, sintáctico y semántico.  Aplicar metodologías para el desarrollo de analizadores léxicos, sintácticos y semánticos mediante el uso de herramientas de software.  Adquirir habilidades para desarrollar herramientas computacionales de procesamiento de lenguajes de programación como compiladores, traductores e intérpretes en diversas áreas de conocimiento. METODOLOGÍA Clases magistrales, exposiciones de estudiantes y prácticas. Conceptos Previos Introducción a la Teoría de la Computación Estructuras de Datos"
    },
    {
      "id": "1000001-B",
      "name": "Matematicas Basicas",
      "credits": 4,
      "type": "NIVELACIÓN (E)",
      "Description": "OBJETIVOS: Generales ¿ Brindar al estudiante los fundamentos conceptuales para abordar los cursos posteriores que requieran la matemática básica. ¿ Promover a través de los talleres, una participación activa del estudiante en su proceso de aprendizaje matemático. ¿ Generar un espacio y tiempo más adecuados para que el estudiante madure e interiorice los conocimientos adquiridos. Específicos ¿ Presentar elementos básicos de lógica que permitan al estudiante incorporar formalismo y validez a sus argumentos. ¿ Desarrollar habilidades básicas para el manejo de operaciones aritméticas y entre conjuntos ¿ Lograr un manejo adecuado de las expresiones algebraicas. ¿ Familiarizar al alumno con la noción de función, su representación gráfica e interpretación, y trabajar con algunas funciones fundamentales tales como las lineales, cuadráticas, exponenciales, logarítmicas y trigonométricas. ¿ Repasar elementos de la geometría euclidiana básica y de la trigonometría elemental. ¿ Hacer una introducción a los métodos de conteo."
    },
    {
      "id": 2025963,
      "name": "Matematicas discretas I",
      "credits": 4,
      "type": "FUND. OPTATIVA (O)",
      "Description": "OBJETIVO GENERAL El propósito de este curso es ofrecer al estudiante de ingeniería de sistemas algunos temas y técnicas de razonamiento matemático que son de naturaleza discreta y en muchos casos finita. De igual forma se busca que el alumno desarrolle destrezas en la forma de definir, describir y usar las matemáticas Discretas en la representación y solución de problemas de ingeniería de sistemas. La solución incluye algoritmos específicos."
    },
    {
      "id": 2025964,
      "name": "Matematicas discretas II",
      "credits": 4,
      "type": "FUND. OPTATIVA (O)",
      "Description": "OBJETIVO GENERAL El propósito de este curso es ofrecer al estudiante de ingeniería de sistemas algunos temas y técnicas de razonamiento matemático que son de naturaleza discreta y en muchos casos finita. De igual forma se busca que el alumno desarrolle destrezas en la forma de definir, describir y usar las matemáticas Discretas en la representación y solución de problemas de ingeniería de sistemas. La solución incluye algoritmos específicos."
    },
    {
      "id": 2015970,
      "name": "Metodos numericos",
      "credits": 3,
      "type": "FUND. OPTATIVA (O)",
      "Description": "OBJETIVO GENERAL Capacitar al estudiante en los conceptos fundamentales del análisis numérico para la solución de problemas matemáticos mediante algoritmos numéricos, con la orientación necesaria para su implementación en computador y aplicados a la solución de problemas en ingeniería. OBJETIVOS ESPECÍFICOS - Implementar soluciones a diversos problemas con procedimientos numéricos en el computador, mediante el paquete matemático MATLAB. - Estimular al alumno para crear sus propias soluciones en el computador para resolver problemas particulares. METODOLOGÍA El propósito de este curso es darle apoyo al estudiante de manera que pueda llevar a cabo su proceso de aprendizaje de manera autónoma; este apoyo está representado por: material escrito, desarrollo de talleres y laboratorios, ejercicios teóricos y prácticos, software didáctico y explicaciones por parte de profesores y monitores. Cada módulo temático está conformado por 4 sesiones distribuidas en dos semanas: una conferencia, una clase, un taller y un laboratorio. A continuación se describe cada tipo de sesión."
    },
    {
      "id": 2025969,
      "name": "Modelos estocasticos y simulacion en computacion y comunicaciones",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": "Generar en los estudiantes un manejo formal de la probabilidad, estadística y los procesos estocásticos, que les permita a través del estudio de distintas estructuras probabiísticas y sistemas computacionales, adquirir las habilidades necesarias para identificar, analizar, modelar y solucionar problemas asociados con sistemas de cómputo y de telecomunicaciones de naturaleza estocástica y dinámica. OBJETIVOS  Generar en los estudiantes un manejo formal de la probabilidad, estadística y los procesos estocásticos, que les permita a través del estudio de distintas estructuras probabiísticas y sistemas computacionales, adquirir las habilidades necesarias para identificar, analizar, modelar y solucionar problemas asociados con sistemas de cómputo y de telecomunicaciones de naturaleza estocástica y dinámica.  Estudiar modelos matemáticos y probabilísticos complejos que permitan describir comportamientos en sistemas de cómputo y telecomunicaciones.  Diseñar experimentos basados en simulación de eventos discretos para estimar medidas de desempeño en sistemas de cómputo y telecomunicaciones.  Proponer metodologías para el análisis de sistemas de cómputo complejos. METODOLOGÍA Clases magistrales, exposiciones de estudiantes y prácticas. Conceptos Previos: Modelos y simulación Optimización"
    },
    {
      "id": 2025970,
      "name": "Modelos y simulacion",
      "credits": 3,
      "type": "DISCIPLINAR OPTATIVA (T)",
      "Description": "El curso se desarrolla a través de sesiones presenciales en donde se explican los conceptos básicos, y se comparten ejemplos que ayuden al aprendizaje práctico de las temáticas, con el soporte de lecturas previas que el estudiante realiza para contextualizar el área de estudio. De tal manera que los estudiantes puedan de forma autónoma desarrollar talleres y estudios de caso basados en el material revisado. Se contará con talleres prácticos en el uso de herramientas de software. - Los contenidos, presentaciones y demás material serán publicados en el curso virtual generado por Moodle. OBJETIVOS: - Las asignaciones (trabajos, talleres) deberán ser entregadas en medio magnético o físico de acuerdo con las especificaciones del docente. En el caso del medio magnético las asignaciones deberán ser cargadas directamente a la página de Moodle. - Todas las sesiones se realizarán en salas de cómputo equipadas con las herramientas de software que posee el departamento de Ingeniería de Sistemas e Industrial de la Facultad de Ingeniería de la Universidad Nacional de Colombia Sede Bogotá. - El enfoque investigativo del curso hará necesario el uso de material bibliográfico de las bases de datos disponibles en la Universidad como Science Direct, JStor, Springer, Scielo, entre otras. Requisitos del curso Los informes que se presentarán en el curso deberán ser escritos en LaTex."
    },
    {
      "id": 2025971,
      "name": "Optimizacion",
      "credits": 3,
      "type": "DISCIPLINAR OPTATIVA (T)",
      "Description": "Los problemas de optimización se plantean muy a menudo en la industria, y la capacidad de resolverlos es una ventaja competitiva. Sin embargo, el modelado de problemas de Optimización requiere herramientas especiales y habilidades. Un problema que no se entiende o se modela incorrectamente puede conducir a la solución equivocada o puede ser muy difícil de resolver. OBJETIVOS Introducir al estudiante en el ambiente de la Investigación de Operaciones entendida ésta como un medio fundamental que soporta una toma acertada de decisiones. Proporcionar las herramientas y conocimientos necesarios para modelar problemas de optimización prácticos y obtener una solución. Propender por el trabajo en equipo y la apropiación de la modelación mediante el uso de talleres de aplicación y estudios de casos. Entender y aplicar el algoritmo Simplex para programación lineal y otros algoritmos para enfrentar y resolver problemas no lineales, enteros, y en estructuras de redes Conocer y aplicar herramientas computacionales (softwares) para resolver modelos de optimización. Capacitar al estudiante en la utilización de diferentes técnicas, algorítmicas y modelos como herramientas para resolver problemas de programación lineal, entera, no lineal, redes, dinámica y de proyectos. AL TERMINAR ESTE CURSO, los alumnos serán capaces de: Identificar los objetivos y las limitaciones basados en las descripciones de los problemas del mundo real. Crear modelos de optimización matemática correspondiente a las descripciones de los problemas. Seleccionar y trabajar a través de una adecuada técnica de solución basada en el tipo de modelo. Utilizar software de optimización para llevar a cabo los análisis; interpretar los resultados. Hacer recomendaciones sólidas basadas en las soluciones, análisis, y las limitaciones de los modelos. Presentar una introducción a las técnicas Meta heurísticas (Opcional) ."
    },
    {
      "id": 2016703,
      "name": "Pensamiento sistemico",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": "OBJETIVO GENERAL Capacitar al estudiante en una fundamentación conceptual sobre la teoría general de sistemas, presentando diferentes concepciones de ésta, y además los conceptos básicos de lo que es la información. METODOLOGÍA Metodología: El curso es teórico práctico. En la primera parte, los estudiantes realizan trabajos de lecturas y discusión en pequeños grupos. La segunda parte exigirá la construcción de modelos utilizando las definiciones. La tercera parte involucra la construcción de modelos utilizando las diferentes herramientas aplicados a problemas de ingeniería y organizaciones."
    },
    {
      "id": 2015178,
      "name": "Probabilidad",
      "credits": 4,
      "type": "FUND. OPTATIVA (O)",
      "Description": "Esta asignatura dispone los elementos de la sintaxis formal de la probabilidad para eventos y variables aleatorias unidimensionales y multidimensionales. Describe los modelos probabilísticos clásicos. Aborda la convergencia y la simulación de variables aleatorias. Se requieren conocimientos de álgebra lineal y de cálculo en varias variables. El estudiante que curse la asignatura y cumpla con las exigencias académicas, podrá: 1. Manejar e interpretar los axiomas y los conceptos fundamentales de la teoría de probabilidad. 2. Reconocer en casos específicos el o los modelos probabilísticos más adecuados en la descripción de una situación real. 3. Fortalecer su formación disciplinar con el pensamiento probabilístico. CONCEPTOS PREVIOS NECESARIOS: Cálculo integral en una variable"
    },
    {
      "id": "1000013-B",
      "name": "Probabilidad y estadistica fundamental",
      "credits": 3,
      "type": "FUND. OPTATIVA (O)",
      "Description": ""
    },
    {
      "id": 2015734,
      "name": "Programacion de computadores",
      "credits": 3,
      "type": "DISCIPLINAR OPTATIVA (T)",
      "Description": "Asignatura de primer semestre del Programa de Ingeniería de Sistemas y Computación y ofertado a otras Ingenierías. El objetivo principal es enseñar a los estudiantes a solucionar problemas mediante la especificación de algoritmos (secuencia finita de pasos bien definida) en un lenguaje de programación como Python, Java, C y/o JavaScript. OBJETIVOS Con el curso de programación de computadores se espera que un estudiante este en capacidad de:  Reconocer problemas a los que se les puede dar solución mediante un algoritmo Aplicar una metodología sistemática para su solución.  Especificar algoritmos de manera precisa utilizando conceptos y elementos de programación.  Implementar la solución algorítmica mediante un lenguaje de programación como Python. Aprende a programar, como aprender a nadar, es un proceso de aprendizaje activo que solo se logra si el estudiante trata de programar, es decir, aprender a programar depende en gran parte de la motivación y trabajo activo del estudiante. METODOLOGÍA En este curso se proporciona material escrito, software didáctico, guías para el desarrollo de talleres y laboratorios (tanto en clase como fuera de ella) y se proponen ejercicios 'básicos' de problemas reales de programación, junto con la exlicación por parte de profesores y monitores."
    },
    {
      "id": 2016375,
      "name": "Programacion orientada a objetos",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": "Asignatura de primer semestre del Programa de Ingeniería de Sistemas y Computación y ofertado a otras Ingenierías. El objetivo principal es enseñar a los estudiantes a solucionar problemas mediante la especificación de algoritmos (secuencia finita de pasos bien definida) en un lenguaje de programación como Python, Java, C y/o JavaScript. Sin embargo, para que ellos cumplan con estas funciones, es necesario programarlos: decirles qué hacer y cómo hacerlo. Esto se hace mediante la especificación de un algoritmo (una secuencia finita de pasos bien definida) en un lenguaje de programación como Python, C++ y/o Java Script. OBJETIVOS  Uno de los enfoques más usados en la actualidad es la programación orientada por objetos (POO). Con el curso de programación orientada por objetos se espera que un estudiante este en capacidad de: Identificar objetos, clases e instancias en la descripción de un problema.  Abstraer mediante métodos y atributos los mismos. Establecer relaciones de herencia, polimorfismo, colaboración, composición entre ellos.  Aplicar una metodología sistemática de POO para la solución de problemas algorítmicos. METODOLOGÍA En este curso se proporciona material escrito, software didáctico, guías para el desarrollo de talleres y laboratorios (tanto en clase como fuera de ella) y se proponen ejercicios 'básicos' de problemas reales de programación, junto con la explicación por parte de profesores y monitores."
    },
    {
      "id": 2025967,
      "name": "Redes de computadores",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": "En este curso se pretende que el estudiante sea capaz de analizar, seleccionar y utilizar los servicios de redes tanto de largo alcance como locales. Además, que adquiera elementos para diseñar e implantar soluciones de diferentes tipos de redes."
    },
    {
      "id": 2025982,
      "name": "Sistemas de informacion",
      "credits": 3,
      "type": "DISCIPLINAR OPTATIVA (T)",
      "Description": "Los Sistemas de Información corresponden a la integración de soluciones de tecnologías de la información y la dinámica de los negocios para satisfacer las necesidades de información de las empresas, lo que les permite a la empresas alcanzar sus objetivos de una manera eficaz y eficiente, esta disciplina hace hincapié en la información y la tecnología como un instrumento para generar, procesar y distribuir la información. Se concentra en definir estrategias de negocio y arquitecturas empresariales que implementen efectiva y eficientemente las tecnologías de información y comunicaciones generando ventajas competitivas para las organizaciones, en consecuencia esta asignatura proporciona a los futuros Ingenieros de Sistemas y Computación y programas afines el marco conceptual en lo referente a los Sistemas de Información."
    },
    {
      "id": 2016053,
      "name": "Sistemas de Informacion Gerencial",
      "credits": 4,
      "type": "DISCIPLINAR OPTATIVA (T)",
      "Description": ""
    },
    {
      "id": 2016707,
      "name": "Sistemas operativos",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": "OBJETIVO GENERAL Adquirir conceptos relacionados con sistemas operativos, teles como estructura, procesos, manejo de memoria, manejo y organización de archivos, y seguridad; que permitan al estudiante el entendimiento y uso adecuado de diferentes sistemas operativos. METODOLOGÍA El contenido es impartido por el profesor en clase, y los estudiantes desarrollan actividades donde aplican el conocimiento adquirido. Conceptos Previos: Arquitectura de Computadores"
    },
    {
      "id": "1000074-B",
      "name": "Suficiencia en lengua extranjera",
      "credits": 12,
      "type": "NIVELACIÓN (E)",
      "Description": "Creación asignatura código nacional ¿Suficiencia en lengua extranjera¿ según oficio DNINFOA-025 -2014"
    },
    {
      "id": 2024045,
      "name": "Taller de proyectos interdisciplinarios",
      "credits": 3,
      "type": "DISCIPLINAR OBLIGATORIA (C)",
      "Description": "El Taller de Proyectos Interdisciplinarios es una asignatura común para varios programas curriculares de la Facultad de Ingeniería que pretende promover el trabajo en equipo e interdisciplinario de los estudiantes, en torno a la solución de problemas en"
    },
    {
      "id": 2015184,
      "name": "Teoria de grafos",
      "credits": 4,
      "type": "FUND. OPTATIVA (O)",
      "Description": "Se estudia la noción de grafo (conjunto de vértices o nodos unidos por arcos) y los distintos tipos de grafos (planos, dirigidos, bipartitos, árboles, etc). Los grafos se utilizan para analizar relaciones binarias y tienen importantes aplicaciones en comb"
    },
    {
      "id": 2016708,
      "name": "Teoria de la computacion",
      "credits": 3,
      "type": "FUND. OBLIGATORIA (B)",
      "Description": "OBJETIVO GENERAL Capacitar al estudiante en los fundamentos de la teoría matemática de la computación secuencial y paralela. Describir los modelos que son fundamentos de su disciplina y conocer y aplicar los conceptos básicos de la complejidad de algoritmos y la complejidad computacional estructural. METODOLOGÍA Este curso se pretende introducir algunos conceptos de teoría de conjuntos así como de los autómatas finitos y las gramáticas formales y teoría de la computación paralela."
    },
    {
      "id": 2025994,
      "name": "Teoría de la informacion y sistemas de comunicacion",
      "credits": 3,
      "type": "DISCIPLINAR OPTATIVA (T)",
      "Description": "Proporcionar un cubrimiento introductorio moderno de un curso tradicional sobre teoría de la información y sistemas de comunicación. El principal objetivo es ayudar a los estudiantes a adquirir las habilidades esenciales, intuitivas y formales, para prepararlos para el estudio de disciplinas tales como teoría avanzada de información, teoría cuántica de la información, comunicaciones ópticas y redes inalámbricas. Específicamente, los estudiantes aprenderán las representaciones matemáticas formales y los métodos de análisis de la teoría de la información y los sistemas de comunicación, adquirirán una comprensión física e intuitica de los temas y la experiencia de la práctica de implementar algunos de los conceptos vistos sobre un computador. OBJETIVOS  Introducir los fundamentos y herramientas matemáticas del análisis y transmisión de señales.  Analizar las señales en el dominio del tiempo y de la frecuencia.  Analizar el proceso de conversión analógica a digital de una señal.  Introducir los principios subyacentes a la transmisión de datos digitales.  Comprender los conceptos fundamentales de la teoría de la información y la codificación de la fuente.  Entender el funcionamiento de los códigos para la detección / corrección de errores. METODOLOGÍA Clases Magistrales. Prácticas de laboratorio en hardware o software de simulación. Evaluaciones teóricas o prácticas. Proyecto final / exposición."
    },
    {
      "id": 2016842,
      "name": "Trabajo de Grado",
      "credits": 6,
      "type": "TRABAJO DE GRADO (P)",
      "Description": ""
    },
    {
      "id": 2016843,
      "name": "Trabajo de grado - asignaturas de posgrado",
      "credits": 6,
      "type": "TRABAJO DE GRADO (P)",
      "Description": ""
    },
    {
      "id": 2025973,
      "name": "Trabajo de grado - modalidad practica de extension",
      "credits": 6,
      "type": "TRABAJO DE GRADO (P)",
      "Description": "Trabajo de grado practica de extensión"
    },
    {
      "id": 2025974,
      "name": "Trabajo de grado - modalidad trabajos investigativos",
      "credits": 6,
      "type": "TRABAJO DE GRADO (P)",
      "Description": "Trabajo de grado modalidad trabajos investigativos"
    }
  ]
}
